<template>
  <el-container id="resume">
    <el-header>
      <el-header>
        <h2>个人简历</h2>
      </el-header>
    </el-header>
    <hr>
    <el-main>
      <ul>
        <li>
          <h3>基本信息：</h3>
          <p>姓名：胡重庆 求职意向：前端开发</p>
          <p>学历：本科 2018年 毕业于 北京服装学院 英语CET-6</p>
          <p> 联系方式：QQ: 810006338 邮箱：810006338@qq.com 电话：18811018100</p>
          <p>个人网站：</p>
          <p>技术栈和工具：Vue全家桶 Element-ui scss/sass Bootstrap Node.js(Express)</p>
        </li>
        <li>
          <h3>个人技能</h3>
            <p>熟悉W3C标准，在工作中使用弹性盒模型和HTML5+CSS3+@media实现响应式布局；</p>
            <p>有比较扎实的JavaScript基础，对闭包、原型与原型链、事件循环等比较了解；</p>
            <p>熟悉ES6规范，对于Promise，async/await 等有一定程度上的了解；</p>
            <p>理解MVC/MVVM模型，在工作中熟练使用Vue/Vuex/Vue-Router，了解Vue的双向绑定原理及虚拟DOM等相关原理；</p>
            <p>有良好的计算机基础，理解计算机网络模型，了解TCP/IP协议及HTTP协议，具备基本的web安全知识；</p>
            <p>了解Node.js，熟悉其常用模块，对Express框架的中间件原理有一定了解；</p>
            <p>了解数据库及SQL语言的使用，掌握数据结构与算法；</p>
            <p>常使用英文文档，有良好的英文阅读能力；</p>
        <li>
          <h3>工作经历</h3>
            <h4>2018.9-2019.4 | 南京酷傲信息技术有限公司 | 岗位：前端开发</h4>
              <p> 工作描述：<br>
                1、协助UI的完成一部分切图工作；<br>
                2、使用HTML标记、div+css进行布局，搭建静态页面；<br>
                3、使用原生JavaScript及jQuey通过Ajax进行数据交互对Dom进行动态操作；<br>
                4、能够独立的处理浏览器兼容性问题，并对网页进行性能优化和SEO网站优化；<br>
                5、用Vue实现model与view层的数据绑定，动态信息展现；<br>
                6、用Vue模块化构建可复用的单例组件；<br>
                7、利用Webpack对js和css文件进行压缩打包合并处理，减少http请求，节省网络宽带；<br>
                8、优化前端性能及后期前端页面的维护、升级并加以总结；<br>
                9、积极跟进互联网前端开发技术的发展，致力于提升用户体验；<br>
              </p>
        </li>
        <li>
          <h3>项目经验</h3>
            <h4>物料后台管理系统（后台管理系统）</h4>
              <p>
                项目描述：<br>
                该项目主要是为目标企业提供一套方便管理所有原料、成品的后台系统。
                包括所有原材料的采购量、到库量、使用量、剩余量、损耗量及成品的生产数、破损数、出货数的统计及管理。
                企业可以通过不同的账号来进行不同的功能操作，比如采购可以通过采购的账号查看所有原材料相关的东西，计划部可以通过自己的账号了解到所有的与生产相关的信息。
                登录过后就可以对自己账号权限内的所有数据进行增、删、改查的处理。
              </p>
              <p>
                主要技术：<br>
                前端采用Vue全家桶 + Bootstrap，使用的定宽布局，使用Ajax发送请求，使用Session保存会话；<br>
                后端是Node.js，使用Express搭建Web服务器，使用Sqlite作为数据库，使用Git控制版本。
              </p>
              <p>我的职责：<br>
                1、主要负责详情页、登录页、注册页的布局以及与后台数据交互的开发；<br>
                2、和后端沟通讨论接口的合理性，使用Axios调用后台接口数据；<br>
                3、和UI沟通产品UI问题，帮助完成小部分切图；<br>
                4、用Vue实现页面模块化，提高了代码的重复利用率；<br>
                5、使用Vue-Router的路由嵌套实现多级页面之间的跳转<br>
                6、利用Webpack实现对文件的压缩和合并，节省空间；<br>
              </p>
            <hr>
            <h4> 扫码点餐系统和餐厅管理（个人项目）</h4>
              <p>项目描述：<br>
                该项目主要是实现了一套较为完整的点餐以及餐厅后台管理的基本流程。
                从顾客端的选就餐人数，同桌客户点餐的实时同步， 订单状态与后台的实时同步，购物车实时更新，查看自己正在进行中的订单状态；
                到餐厅管理端的登录、注册、验证、找回密码，以及一些管理功能包括添加菜品、添加桌面、实现对订单、菜品、桌面信息的增、删、改处理及状态同步。
              </p>
              <p>
                主要技术：
                前端Vue + Vue-Router + Vuex + elementUI + Vue-socket；<br>
                后端Node.js实现，使用了 Express + Sqlite + Socket.io；
              </p>
              <p>我的职责：<br>
                1、后端服务器的基本搭建，使用Express搭建服务器，接口的构思，提供接口出来供前端使用；<br>
                2、使用Sqlite作为数据库来存储相关信息，
                  主要table有users(餐厅登录注册有关信息)、foods(餐品有关信息)、orders(订单信息)、desks(桌面信息)；<br>
                3、使用Vue-Cli创建前端项目，使用Vue-Router的路由嵌套实现多级页面之间的跳转，
                  主要有登录注册、订单管理、订单详情、菜品管理、桌面管理、顾客点餐、点餐成功及订单信息、工作台(添加菜品、添加桌面)；<br>
                4、用Vue实现页面模块化，提高了代码的重复利用率；<br>
                5、使用封装后的Axios的调用后台接口数据；<br>
                6、使用Socket.io配合前端使用的Vue-Socket实现前端实现数据实时更新，
                  如同桌顾客点餐信息同步，餐厅后台订单状态与顾客端订单状态同步，餐厅后台订单、菜品、桌面页面之间的信息的同步；<br>
                7、利用Webpack对js和css文件进行压缩打包合并处理，减少http请求，节省网络宽带；<br>
                8、优化前端性能及后期前端页面的维护、升级并加以总结；<br>
              </p>
            <h3>在线地址：</h3>
              <h4>商户侧：<a href="http://47.96.148.104/#/login">http://47.96.148.104/#/login</a></h4>
              <h4>顾客侧:(请扫码)<img src="http://47.96.148.104/QR" alt="顾客侧"></h4>
            <h3>代码地址：</h3>
              <h4>github地址：</h4>
        </li>
      </ul>
    </el-main>
  </el-container>
</template>

<style lang="scss" scoped>
#resume{
  width:850px;
  margin:auto;
}
</style>

<script>
export default {
  name: 'Resume',
};
</script>
